BaseConfiguration/Money_2_0/Catalogs/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Долги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляУчетаВзятыхДолгов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляУчетаВыданныхДолгов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контакты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/Долги/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ОбщегоНазначенияДеньги.ЗаполнитьОбъектПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
		
		ДополнительныеПараметрыСоздания = Неопределено;
		Если ДанныеЗаполнения.Свойство("ДополнительныеПараметрыСоздания", ДополнительныеПараметрыСоздания) Тогда
			Если ДополнительныеПараметрыСоздания.Свойство("Наименование") Тогда
				Наименование = ДополнительныеПараметрыСоздания.Наименование;
				ТекстЗаполнения = Наименование;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	// Заполняем незаполненные реквизиты значениями по умолчанию:
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Если ЗначениеЗаполнено(Контакт) И ЗначениеЗаполнено(Контакт.Валюта) Тогда
			Валюта = Контакт.Валюта;
		Иначе
			Валюта = Константы.ВалютаУчета.Получить();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение обязательных и информационных реквизитов
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Если ЗначениеЗаполнено(Контакт) И ЗначениеЗаполнено(Контакт.Валюта) Тогда
			Валюта = Контакт.Валюта;
		Иначе
			Валюта = Константы.ВалютаУчета.Получить();
		КонецЕсли;
	КонецЕсли; 
	
	ОтложеннаяЗапись = ДополнительныеСвойства.Свойство("ОтложеннаяЗапись");
	// Проверки перед записью
	Если Не Отказ И Не ОтложеннаяЗапись 
		И (ЭтоНовый() Или Ссылка.ПометкаУдаления = ПометкаУдаления) Тогда
		ОбслуживаниеСправочников.ПроверкаНаименованияСправочникаПередЗаписью(ЭтотОбъект, Отказ);
	КонецЕсли;
	Если Не Отказ И Не ОтложеннаяЗапись Тогда
		ОбслуживаниеСправочников.СогласованиеПометкиИАктивностиПередЗаписью(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ПроцессыОбменаСлужебный.ПередЗаписьюИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтложеннаяЗапись = ДополнительныеСвойства.Свойство("ОтложеннаяЗапись");
	Если Не ОтложеннаяЗапись Тогда
		ОбслуживаниеСправочников.ОбновлениеСвязаннойИнформацииПриЗаписи(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти


#КонецЕсли
